Напишите программу, 
удаляющую из текста все слова,
содержащие ""абв"".
~~~
text = 'абвиифбвав abвdfffgc аалллауддыд абвкуувабв какавкааап аьвабаб'


def del_words(text):
    text = list(filter(lambda x: 'абв' not in x and 'abв' not in x, text.split()))
    return " ".join(text)


text = del_words(text)
print(text)
~~~
Задайте последовательность чисел.
Напишите программу, которая выведет
список неповторяющихся элементов 
исходной последовательности.
~~~
lst = list(map(int, input("Введите числа через пробел:\n").split()))
print(f"Исходный список: {lst}")
new_lst = []
[new_lst.append(i) for i in lst if i not in new_lst]
print(f"Список из неповторяющихся элементов: {new_lst}")
 ~~~
Задайте список из вещественных чисел.
Напишите программу, которая найдёт 
разницу между максимальным и минимальным
значением дробной части элементов.
Пример:
- [1.1, 1.2, 3.1, 5, 10.01] => 0.19
~~~
float_list = [1.1, 1.2, 3.1, 5, 10.01]
list = [round(i % 1,2) for i in float_list if i % 1 != 0]
print(max(list) - min(list))
print(5%13)
~~~
Напишите программу, которая найдёт
произведение пар чисел списка.
Парой считаем первый и последний элемент,
второй и предпоследний и т.д.
Пример:
- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]
~~~
numbers = [2, 5, 6, 7, 8]
num = list(a*b for a, b in zip(numbers, numbers[:(len(numbers)//2)-1:-1]))
print(num)
~~~
Задайте натуральное число N.
Напишите программу, которая
составит список 
простых множителей числа N.
~~~
n = abs(int(input('Введите число: ')))
def f(x): return 1 if x == 1 else x*f(x-1)


print([f(i) for i in range(1, n+1)])
~~~